# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка,
# стоящих на нечётной позиции.

# Пример:

# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
#
def sum_all(list_1):
    sum = 0

    for i in range(len(list_1)):
        if i % 2 != 0:
            sum += int(list_1[i])
    return sum

list_1 = input().split()
print(sum_all(list_1))

#Variant 2
x = list(map(int,input().split()))
sum = 0
for i in range(1, len(x),2):

        sum += x[i]
print(f'summa:{sum}')


# ************2****************
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и
# последний элемент, второй и предпоследний и т.д.

# Пример:
#
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


x = list(map(int, input().split()))
k = 0
list_2 = []
for i in range(len(x)//2):

    k = x[i] * x[len(x) - i - 1 ]
    list_2.append(k)
if len(x) %2:# True = 1 else = 0  False
    list_2.append(x[len(x)//2])

print(list_2)

# *************3**************
# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу
# между максимальным и минимальным значением дробной части элементов.

# Пример:
#
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

list_1 = list(map(float, input().split()))
list_2 = list_1.copy()
list_2 = list(map(int,list_1))

result = [i - e for i, e in zip(list_1, list_2)]
print(round(max(result) - min(result),2))


# ****************4*********
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

# Пример:
#
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
n = int(input())
print(bin(n))
x = ''
while n != 0:
    x = str(n%2) + x
    n //= 2
print(x)


# ******5*****************
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]
# [Негафибоначчи]

n = int(input())
def Fibon_1(n):
    num = [0]
    a = 1
    b = 1
    for i in range(n):
        num.append(a)
        num.insert(0, a * (-1) ** i)
        a, b = b, a + b
    return num


print(Fibon_1(n))